package by.htp.less.cycles;

// — помощью оператора while напишите программу вывода всех четных чисел в диапазоне от 2 до 100 включительно

public class Task04 {
	public static void main(String[]args){
	
	            int a = 0;  // создаем переменную и ее значение
	            
	            while (a<100 ){  // тут цикл сравнени€

	            	a = a + 2;
	            	
	                
	         System.out.println(a);// вывод в консоль
	           
	      }
	 } 
}
		
	


